{
  "spa_services": [
    {
      "service_type": "Full Facials",
      "services": [
        {
          "type": "Full Facials",
          "service_name": "Hydro Glowskin Brightening Facial",
          "description": null,
          "price": 150.0
        },
        {
          "type": "Full Facials",
          "service_name": "LED Light Therapy Facial\n",
          "description": null,
          "price": 90.0
        },
        {
          "type": "Full Facials",
          "service_name": "Microdermabrasion Facial",
          "description": null,
          "price": 90.0
        },
        {
          "type": "Full Facials",
          "service_name": "Advanced Exfoliation - Pumpkin Facial",
          "description": null,
          "price": 80.0
        },
        {
          "type": "Full Facials",
          "service_name": "Hyperpigmentation/ Melasma Facial",
          "description": null,
          "price": 80.0
        },
        {
          "type": "Full Facials",
          "service_name": "Acne Skin Treatment Facial",
          "description": null,
          "price": 80.0
        },
        {
          "type": "Full Facials",
          "service_name": "Back Facial",
          "description": null,
          "price": 75.0
        },
        {
          "type": "Full Facials",
          "service_name": "Facial with Extractions",
          "description": null,
          "price": 60.0
        },
        {
          "type": "Full Facials",
          "service_name": "Classic( No black heads & white head removal)",
          "description": null,
          "price": 50.0
        },
        {
          "type": "Full Facials",
          "service_name": "Microdermabrasion",
          "description": null,
          "price": 90.0
        },
        {
          "type": "Full Facials",
          "service_name": null,
          "description": null,
          "price": null
        },
        {
          "type": "Full Facials",
          "service_name": null,
          "description": null,
          "price": null
        },
        {
          "type": "Full Facials",
          "service_name": null,
          "description": null,
          "price": null
        },
        {
          "type": "Full Facials",
          "service_name": null,
          "description": null,
          "price": null
        }
      ]
    },
    {
      "service_type": "Waxing",
      "services": [
        {
          "type": "Waxing",
          "service_name": "Brow Shaping",
          "description": "A precision brow waxing service designed to enhance your natural brow shape. Removes unwanted hair for clean, defined brows that frame your face beautifully. Finished with soothing products to minimize redness.",
          "price": 15.0
        },
        {
          "type": "Waxing",
          "service_name": "Brow Maintenance",
          "description": "Perfect for maintaining already-shaped brows. This quick touch-up removes stray hairs and keeps your brows neat and polished. Ideal between full shaping appointments.",
          "price": "Starting at $15.00"
        },
        {
          "type": "Waxing",
          "service_name": "Full Face",
          "description": "A complete facial waxing service that removes unwanted hair from the brows, upper lip, chin, cheeks, and sideburns. Leaves skin smooth, fresh, and makeup-ready. Suitable for all skin types with gentle waxing techniques.",
          "price": 35.0
        },
        {
          "type": "Waxing",
          "service_name": "Lips",
          "description": "Gently removes unwanted hair from the upper lip area for smooth, clean skin. The treatment is quick and effective with minimal discomfort. Finished with calming products to soothe the skin.",
          "price": 5.0
        },
        {
          "type": "Waxing",
          "service_name": "Chin",
          "description": "Targets unwanted hair on the chin area for a smooth and polished look. Helps prevent ingrown hairs and irritation compared to shaving. Ideal for regular maintenance.",
          "price": 8.0
        },
        {
          "type": "Waxing",
          "service_name": "Lip and Chin",
          "description": "A combination service that removes unwanted hair from both the upper lip and chin. Leaves the skin smooth and refreshed with longer-lasting results. Perfect for convenient facial hair maintenance.",
          "price": 12.0
        },
        {
          "type": "Waxing",
          "service_name": "Side-Burns",
          "description": "Removes unwanted hair along the side-burn area for a clean and defined facial contour. Helps create a smoother, more balanced appearance. Gentle techniques ensure comfort.",
          "price": 10.0
        },
        {
          "type": "Waxing",
          "service_name": "Underarms",
          "description": "Removes hair from the underarm area for smooth, clean skin. Helps reduce hair regrowth over time and keeps you feeling fresh longer. Suitable for sensitive skin.",
          "price": 15.0
        },
        {
          "type": "Waxing",
          "service_name": "Full Arms",
          "description": "Removes hair from shoulders to wrists for silky-smooth arms. Leaves skin soft and even with longer-lasting results than shaving. Great for a polished look year-round.",
          "price": 40.0
        },
        {
          "type": "Waxing",
          "service_name": "Half Arms",
          "description": "Targets either the upper or lower arms to remove unwanted hair. Ideal for clients looking for smooth skin with minimal maintenance. Finished with soothing care for comfort.",
          "price": 30.0
        },
        {
          "type": "Waxing",
          "service_name": "Full Legs",
          "description": "Complete hair removal from thighs to ankles for ultra-smooth legs. Provides long-lasting results and softer regrowth. Perfect for vacations, special occasions, or regular upkeep.",
          "price": 50.0
        },
        {
          "type": "Waxing",
          "service_name": "Half Legs",
          "description": "Removes hair from either the upper or lower leg area. Leaves skin smooth and refreshed with longer-lasting results than shaving. A great option for quick maintenance.",
          "price": 40.0
        },
        {
          "type": "Waxing",
          "service_name": "Chest",
          "description": "Removes unwanted hair from the chest area for a clean and groomed appearance. Performed with professional techniques to minimize irritation. Suitable for all hair types.",
          "price": 20.0
        },
        {
          "type": "Waxing",
          "service_name": "Stomach",
          "description": "Targets unwanted hair from the stomach area for smooth, clean skin. Helps create a more polished look with longer-lasting results. Finished with calming products.",
          "price": 20.0
        },
        {
          "type": "Waxing",
          "service_name": "Back",
          "description": "Removes hair from the full back area for smooth, refreshed skin. Ideal for reducing irritation caused by shaving or trimming. Leaves skin clean and well-groomed.",
          "price": 30.0
        },
        {
          "type": "Waxing",
          "service_name": "Bikini Line",
          "description": "Removes unwanted hair along the bikini line for a clean, natural finish. Designed to stay within the swimsuit line while keeping skin smooth. Gentle and hygienic techniques used.",
          "price": 30.0
        },
        {
          "type": "Waxing",
          "service_name": "Brazilian",
          "description": "Removes most or all hair from the bikini area, including front and back, based on your preference. Leaves skin smooth and fresh with longer-lasting results. Performed with care for comfort and hygiene.",
          "price": 60.0
        },
        {
          "type": "Waxing",
          "service_name": "Full Body",
          "description": "A comprehensive waxing service covering multiple areas of the body for head-to-toe smoothness. Ideal for those looking for complete hair removal in one session. Leaves skin silky and polished.",
          "price": "Starting at $250.00"
        },
        {
          "type": "Waxing",
          "service_name": "Bikini Line",
          "description": "A targeted service that cleans up hair along the bikini edges for a neat and natural look. Perfect for maintaining smoothness while keeping a subtle finish. Gentle on sensitive skin.",
          "price": 35.0
        }
      ]
    },
    {
      "service_type": "Threading",
      "services": [
        {
          "type": "Threading",
          "service_name": "Brow shaping",
          "description": "An artful brow threading service designed to sculpt and define your natural brow shape with precision. This gentle, chemical-free technique creates clean lines while being kind to sensitive skin. Finished with soothing care for a refined, polished look.",
          "price": 12.0
        },
        {
          "type": "Threading",
          "service_name": "Brow maintenance",
          "description": "A refined touch-up service to maintain beautifully shaped brows. Removes fine regrowth and stray hairs with expert precision for a consistently flawless appearance. Ideal for preserving brow definition between shaping sessions.",
          "price": 10.0
        },
        {
          "type": "Threading",
          "service_name": "Full Face",
          "description": "A luxurious full-face threading experience that removes unwanted hair from the brows, upper lip, chin, cheeks, and sideburns. This ancient technique delivers smooth, radiant skin while enhancing facial contours. Perfect for those seeking a clean, flawless complexion.",
          "price": 30.0
        },
        {
          "type": "Threading",
          "service_name": "Lips  ",
          "description": "A delicate threading service that precisely removes unwanted hair from the upper lip area. Leaves skin smooth, refined, and makeup-ready without the use of chemicals. Ideal for sensitive skin types.",
          "price": 5.0
        },
        {
          "type": "Threading",
          "service_name": "Chin",
          "description": "Targets unwanted chin hair with exceptional accuracy for a smooth, polished finish. This gentle technique minimizes irritation while delivering long-lasting results. Leaves the skin clean, soft, and refined.",
          "price": 8.0
        },
        {
          "type": "Threading",
          "service_name": "Lips and Chin",
          "description": "A perfectly paired service that removes unwanted hair from both the upper lip and chin. Offers precise results with a smooth, elegant finish. Ideal for maintaining a flawless and well-groomed appearance.",
          "price": 12.0
        },
        {
          "type": "Threading",
          "service_name": "Side Burns",
          "description": "A precision threading service designed to clean and define the side-burn area. Enhances facial balance and creates a smooth, contoured look. Finished with calming care for a luxurious experience.",
          "price": 10.0
        }
      ]
    },
    {
      "service_type": "Massage",
      "services": [
        {
          "type": "Massage",
          "service_name": "Hot Stone Massage - 20 Minutes",
          "description": "Indulge in a deeply relaxing hot stone massage designed to melt away tension and restore balance. Warm, smooth stones are gently placed and massaged over key areas to ease muscle stiffness, improve circulation, and promote deep relaxation. This luxurious 20-minute treatment is perfect for a quick yet rejuvenating escape, leaving you feeling calm, refreshed, and renewed.",
          "price": 25.0
        }
      ]
    },
    {
      "service_type": "Hands Heena ( Mehndi) Tattoo",
      "services": [
        {
          "type": "Hands Heena ( Mehndi) Tattoo",
          "service_name": "Hands Heena Tattoo",
          "description": "Experience the beauty of traditional artistry with a luxurious hand henna tattoo application. Using natural, skin-safe henna, intricate designs are carefully crafted to enhance the elegance of your hands. This relaxing and artistic service leaves you with a rich, temporary stain that deepens beautifully over time, perfect for celebrations, special occasions, or personal expression.",
          "price": 20.0
        }
      ]
    }
  ]
}